<?php
// +--------------------------------------------------------------------------------------
// + AcPHP
// +--------------------------------------------------------------------------------------
// + 版权所有 2015年11月8日 贵州天岛在线科技有限公司，并保留所有权利。
// + 网站地址: http://www.acphp.com
// +--------------------------------------------------------------------------------------
// + 这不是一个自由软件！您只能在遵守授权协议前提下对程序代码进行修改和使用；不允许对程序代码以任何形式任何目的的再发布。
// + 授权协议：http://www.acphp.com/license.html
// +--------------------------------------------------------------------------------------
// + Author: AcPHP  http://www.jiangzg.com/ <2992265870@qq.com/jiangzg>
// + Release Date: 2015年11月8日 上午12:08:32
// +--------------------------------------------------------------------------------------

// +--------------------------------------------------------------------------------------
// + 杂项配置
// +--------------------------------------------------------------------------------------
return array (
		'DEFAULT' => array (
				// 是否开启调试模式
				'debug' => TRUE,
				'ERROR_PAGE'=>'f',
				// 加密混淆字符串
				'AUTH_KEY' => 'jiangzg',
				// 设置时间戳
				'TIMEZONE' => 'PRC',
				// 网页显示编码
				'CHARSET' => 'utf-8',
				'error_page'=>'',
				'page_size'=>15,
				'page_both'=>3,
				'token_key'=>'TOKEN_KEY',
				'tips_time'=>3
		) 
);
?>