<?php
// +--------------------------------------------------------------------------------------
// + AcPHP
// +--------------------------------------------------------------------------------------
// + 版权所有 2015年11月8日 贵州天岛在线科技有限公司，并保留所有权利。
// + 网站地址: http://www.acphp.com
// +--------------------------------------------------------------------------------------
// + 这不是一个自由软件！您只能在遵守授权协议前提下对程序代码进行修改和使用；不允许对程序代码以任何形式任何目的的再发布。
// + 授权协议：http://www.acphp.com/license.html
// +--------------------------------------------------------------------------------------
// + Author: AcPHP http://www.jiangzg.com/ <2992265870@qq.com/jiangzg>
// + Release Date: 2015年11月8日 上午12:14:03
// +--------------------------------------------------------------------------------------

// +--------------------------------------------------------------------------------------
// + SESSION专属配置项
// +--------------------------------------------------------------------------------------
return array (
		
		'DEFAULT' => array (
				// 是否自动开启Session
				'SESSION_AUTO_START' => true,
				// session hander类型 默认无需设置 除非扩展了session hander驱动
				'SESSION_TYPE' => 'File',
				// session 前缀
				'SESSION_PREFIX' => '__xems_',
				'SERVER' => array('127.0.0.1,11211','127.0.0.1,11211'),
		) 
);