<?php
// +--------------------------------------------------------------------------------------
// + AcPHP
// +--------------------------------------------------------------------------------------
// + 版权所有 2015年11月8日 贵州天岛在线科技有限公司，并保留所有权利。
// + 网站地址: http://www.acphp.com
// +--------------------------------------------------------------------------------------
// + 这不是一个自由软件！您只能在遵守授权协议前提下对程序代码进行修改和使用；不允许对程序代码以任何形式任何目的的再发布。
// + 授权协议：http://www.acphp.com/license.html
// +--------------------------------------------------------------------------------------
// + Author: AcPHP http://www.jiangzg.com/ <2992265870@qq.com/jiangzg>
// + Release Date: 2015年11月8日 上午12:14:03
// +--------------------------------------------------------------------------------------
defined ( 'C_CA' ) or exit ( 'Server error does not pass validation test.' );

return array (
		
		'DEFAULT' => array (
				//缓存时间
				'CACHEFIX'=>'cache_',
				//缓存时间
				'CACHETIME'=>'3600',
				//缓存类型
				'CACHETYPE'=>'File',
				
				'MEMCACHE' => array (
						'server' => array (
								'127.0.0.1,11211',
								'127.0.0.1,11211' 
						) 
				),
				'FILE' => array (
						'cachepath'=>C_CACHE_PATH.'Cache_data/',
				) 
		) 
);