<?php
// +--------------------------------------------------------------------------------------
// + AcPHP
// +--------------------------------------------------------------------------------------
// + 版权所有 2015年11月4日 贵州天岛在线科技有限公司，并保留所有权利。
// + 网站地址: http://www.acphp.com
// +--------------------------------------------------------------------------------------
// + 这不是一个自由软件！您只能在遵守授权协议前提下对程序代码进行修改和使用；不允许对程序代码以任何形式任何目的的再发布。
// + 授权协议：http://www.acphp.com/license.html
// +--------------------------------------------------------------------------------------
// + Author: AcPHP  http://www.jiangzg.com/ <2992265870@qq.com/jiangzg>
// + Release Date: 2015-11-13 下午5:58:31
// +--------------------------------------------------------------------------------------
defined('C_CA') or exit('Server error does not pass validation test.');

class xDB{
	// +----------------------------------------------------------------------------------
	// + 数据库链接句柄
	// +----------------------------------------------------------------------------------
	private static $db_connect = array();
	
	public static function db($database_config){
		$database_config = $database_config;
		$connect_key = md5(serialize($database_config));
		//已经链接过数据库
		if(isset(self::$db_connect[$connect_key]) && is_object(self::$db_connect[$connect_key])){
			return self::$db_connect[$connect_key];
		}
		// +------------------------------------------------------------------------------
		// + 抛出数据库连接错误
		// +------------------------------------------------------------------------------
		if($database_config==''){
			E('必须配置数据连接');
		}
		$class = 'DB'.ucfirst(strtolower($database_config['db_type']));
		// +------------------------------------------------------------------------------
		// + 载入接口
		// +------------------------------------------------------------------------------
		App::loadClass('DBAbstract',C_SYS_LIBRARY_PATH.'DB'.C_DIR_FIX);
		// +------------------------------------------------------------------------------
		// + 载入驱动
		// +------------------------------------------------------------------------------
		App::loadClass($class,C_SYS_LIBRARY_PATH.'DB/Drive'.C_DIR_FIX);
		// +------------------------------------------------------------------------------
		// + 连接数据库操作
		// +------------------------------------------------------------------------------
		self::$db_connect[$connect_key] = new $class();
		
		if(self::$db_connect[$connect_key]->connect($database_config)){
			return self::$db_connect[$connect_key];
		}else{
			E('数据连接出错');
		}
	}
	
}












