<?php
// +--------------------------------------------------------------------------------------
// + AcPHP
// +--------------------------------------------------------------------------------------
// + 版权所有 2015年11月8日 贵州天岛在线科技有限公司，并保留所有权利。
// + 网站地址: http://www.acphp.com
// +--------------------------------------------------------------------------------------
// + 这不是一个自由软件！您只能在遵守授权协议前提下对程序代码进行修改和使用；不允许对程序代码以任何形式任何目的的再发布。
// + 授权协议：http://www.acphp.com/license.html
// +--------------------------------------------------------------------------------------
// + Author: AcPHP http://www.jiangzg.com/ <2992265870@qq.com/jiangzg>
// + Release Date: 2015年11月8日 上午12:14:15
// +--------------------------------------------------------------------------------------
return array (
		
		'DEFAULT' => array (
				'token' => 'dd64e8153ce79370618986175fd5f669',
				'ip_max_num'=>5,
				'mobile_max_num'=>5,
				'msm_len'=>6,
				'expire_time'=>1800,
				'tpl_id'=>1304333
		) 
);